app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Pre school test"], ["updated_at", "2020-06-13 01:19:32.956358"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)