app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "tanattha"], ["last_name", "thuenim"], ["created_at", "2020-06-13 00:51:53.345447"], ["updated_at", "2020-06-13 00:51:53.345447"]]
---
    def create
      @student = Student.new(post_params)
      @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "test"], ["updated_at", "2020-06-13 01:00:08.054152"], ["id", 1]]
---
    def update
      @student = Student.find(params[:id])
      @student.update(post_params)